# Название команды
print("Чётное-нечётное")

A = int(input("Введите начальное число "))
B = int(input("Введите конечное число "))

# Проверка на подлинность
if A >= B:
    Summ = "Ошибка ввода"
# Представим числовой ряд от А до B. Разобъём числа на пары: чётное и нечётное. Разность этих двух чисел всегда будет 1.
# Два варианта: либо числа А и B будут разной чётности - тогда суммарное количество чисел чётное и ровно делится на пары
# В таком случае сумма будет равна количеству пар чисел
elif (A % 2 == 0 and B % 2 != 0) or (A % 2 != 0 and B % 2 == 0):
    Summ = (B-A+1)/2
# Второй вариант - числа А и B будут одинаковой чётности
# В этом случае мы разбиваем все числа на пары кроме последнего числа, считаем количеств этих пар
# И вычитаем резульат из B
else:
    Summ = B-(B-A)/2

print(Summ)